app/views/posts/search.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 4]]
---

	<% p.comments.each do |c| %>