app/views/posts/sortby.html.erb


	<% p.comments.each do |c| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 6]]