app/controllers/comments_controller.rb

  def vote

  	comment = Comment.find(params[:id])

    # current_user.posts_voted_for=[1,2,3]
    # current_user.save

    if current_user.posts_upvoted.include?(params[:id])
      comment.votes -= 1
      comment.save

      current_user.posts_upvoted.delete(params[:id])
      current_user.save
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "comments" SET "votes" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["votes", 1], ["updated_at", "2017-11-25 09:08:44.393758"], ["id", 1]]
UPDATE "users" SET "posts_downvoted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["posts_downvoted", "---\n- '2'\n"], ["updated_at", "2017-11-28 05:53:22.194529"], ["id", 2]]