app/controllers/posts_controller.rb

UPDATE "users" SET "ip_address" = ?, "lat" = ?, "long" = ?, "city" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["ip_address", "73.71.77.114"], ["lat", 37.5079], ["long", -121.9599], ["city", "Fremont"], ["updated_at", "2017-11-25 09:08:31.216147"], ["id", 1]]
INSERT INTO "locations" ("city", "created_at", "updated_at") VALUES (?, ?, ?)  [["city", "Fremont"], ["created_at", "2017-11-25 09:08:31.229001"], ["updated_at", "2017-11-25 09:08:31.229001"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."city" = ? LIMIT ?  [["city", "Fremont"], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 4]]
---
  def index
    require 'open-uri'
    @ip = open('http://whatismyip.akamai.com').read
    current_user.ip_address = @ip
    current_user.save

# <%=Geocoder.search(@ip).first.city%>


    loc = Location.find_or_create_by(city: current_user.city)
    loc.save

		posts = loc.posts
		now = Time.now

		for post in posts
			diff = time_diff(Time.now, post.created_at)
			if diff[0..1].to_i > 24
				post.destroy

SELECT  "locations".* FROM "locations" WHERE "locations"."city" = ? LIMIT ?  [["city", "Berkeley"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE (text LIKE '%search%') ORDER BY created_at DESC
---
  def search
    loc = Location.find_or_create_by(city: current_user.city)
    @posts = loc.posts
    if params[:search]
      @posts = Post.search(params[:search]).order("created_at DESC")

INSERT INTO "locations" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-11-29 09:18:20.190270"], ["updated_at", "2017-11-29 09:18:20.190270"]]
SELECT  "locations".* FROM "locations" WHERE "locations"."city" = ? LIMIT ?  [["city", "Berkeley"], ["LIMIT", 1]]
---
	def sortby
		loc = Location.find_or_create_by(city: current_user.city)

INSERT INTO "posts" ("text", "votes", "created_at", "updated_at", "user_id", "location_id", "time") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "users" SET "updated_at" = ?, "posts_made" = ? WHERE "users"."id" = ?  [["updated_at", "2017-11-25 09:08:34.233001"], ["posts_made", 1], ["id", 1]]
SELECT  "locations".* FROM "locations" WHERE "locations"."city" = ? LIMIT ?  [["city", "Fremont"], ["LIMIT", 1]]
---
  def create

    if current_user.auto_deleted_posts >= 3
      render :banned

    else
      require 'open-uri'
      ip = open('http://whatismyip.akamai.com').read
      current_user.ip_address = ip
      current_user.save

      loc = Location.find_or_create_by(city: current_user.city)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("text", "post_id", "created_at", "updated_at", "votes", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["text", "asdf"], ["post_id", 1], ["created_at", "2017-11-25 09:08:41.860284"], ["updated_at", "2017-11-25 09:08:41.860284"], ["votes", 0], ["user_id", 1]]
---
  def createcomment
  	post = Post.find(params[:id])
  	comment = Comment.new
  	comment.text = params[:text]
  	comment.post = post
    comment.user = current_user
  	comment.save

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "votes" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["votes", 1], ["updated_at", "2017-11-25 09:08:38.822764"], ["id", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 7]]
UPDATE "users" SET "posts_downvoted" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["posts_downvoted", "---\n- '4'\n"], ["updated_at", "2017-11-28 01:06:07.325937"], ["id", 1]]
---
  def vote

  	post = Post.find(params[:id])

    #
    # current_user.posts_voted_for=[1,2,3]
    # current_user.save

    if current_user.posts_upvoted.include?(params[:id])
      post.votes -= 1
      post.save

      current_user.posts_upvoted.delete(params[:id])
      current_user.save